<!---->
<!--8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».-->
<?php
$arr_area_towns = [
    "Московская область" => ["Москва", "Королев", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Рязань", "Касимов", "Сасово", "Скопин"],
    "Белгородская область" => ["Белгород","Старый оскол","Щебекино","Строитель"]
];

foreach ($arr_area_towns as $key => $arr_towns) {
    echo $key . ':<br>';
    $count = count($arr_towns);

    for ($i = 0; $i < $count + 1; $i++){
        $pos = mb_substr($arr_towns[$i], 0, 1, 'UTF-8');
        if ($pos=='К')
            if ($i != $count)
                echo $arr_towns[$i].' ,';
            else
                echo $arr_towns[$i] . '.<br>';
    }
}
